[
  {
    "source": {
      "id": "the-new-york-times",
      "name": "The New York Times"
    },
    "author": "CARLOTTA GALL",
    "title": "Turks Search Far-Flung Sites and Question Workers in Case of Missing Journalist",
    "description": "An aerial view of Belgrad Forest in Istanbul, one of three sites investigators are said to be looking for evidence in the case of Jamal Khashoggi. He was last seen entering the Saudi Consulate on Oct. 2 and is thought to have been assassinated by Saudi agents.",
    "url": "https://www.nytimes.com/2018/10/19/world/europe/turkey-jamal-khashoggi-investigation.html",
    "urlToImage": "https://static01.nyt.com/images/2018/10/20/world/20turkey-saudi2/20turkey-saudi2-facebookJumbo.jpg",
    "publishedAt": "2018-10-19T16:58:34Z",
    "content": "ISTANBUL Turkish investigators have extended their inquiry into the suspected assassination of a dissident journalist by Saudi Arabian officials to three areas in or near Istanbul, a Turkish official said on Friday, while police officers and prosecutors quest… [+1599 chars]"
  },
  {
    "source": {
      "id": "reuters",
      "name": "Reuters"
    },
    "author": "Gulsen Solaker",
    "title": "Turkey: Saudi hunt for Kashoggi killers must go 'top to bottom'",
    "description": "Turkey's president on Tuesday dismissed Saudi Arabia's efforts to blame the killing of a prominent journalist on rogue operatives, calling it a planned, \"savage killing\", and demanded Riyadh punish those responsible no matter how highly placed.",
    "url": "https://www.reuters.com/article/us-saudi-khashoggi-turkey/turkey-saudi-hunt-for-kashoggi-killers-must-go-top-to-bottom-idUSKCN1MX1EA",
    "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20181023&t=2&i=1317760231&w=1200&r=LYNXNPEE9M0QP",
    "publishedAt": "2018-10-23T14:47:40Z",
    "content": "ANKARA (Reuters) - Turkey’s president on Tuesday dismissed Saudi Arabia’s efforts to blame the killing of a prominent journalist on rogue operatives, calling it a planned, “savage killing”, and demanded Riyadh punish those responsible no matter how highly pla… [+5582 chars]"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "John Haltiwanger",
    "title": "'I’m not going to stop': Friend of missing journalist Khashoggi says Saudi government knew about a 'dangerous' secret project they were working on",
    "description": "A friend of missing Saudi journalist Jamal Khashoggi said they were working on a secret project together that the Saudi government apparently knew about before he disappeared. The project, dubbed \"the bees,\" aimed to build an online army by providing Saudi ac…",
    "url": "https://www.businessinsider.com/khashoggis-says-saudis-knew-about-secret-project-they-were-working-on-2018-10",
    "urlToImage": "https://amp.businessinsider.com/images/5bc8d26bf5d5cc19fd4f8f17-1920-960.jpg",
    "publishedAt": "2018-10-18T19:19:14Z",
    "content": "A friend of Saudi journalist Jamal Khashoggi said they were working on a secret project together that the Saudi government apparently knew about before he disappeared. Omar Abdulaziz, a 27-year-old Saudi national and opposition activist, told The Washington P… [+2650 chars]"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "John Haltiwanger",
    "title": "Missing journalist Jamal Khashoggi had a complicated past involving interviews with Osama bin Laden and close ties to the Saudi royal family",
    "description": "Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October after entering the Saudi consulate in Istanbul. Khashoggi went from interviewing Osama bin Laden in the 1980s to becoming one of the most prominent journal…",
    "url": "https://www.businessinsider.com/missing-saudi-journalist-jamal-khashoggi-ties-to-osama-bin-laden-islamists-2018-10",
    "urlToImage": "https://amp.businessinsider.com/images/5bc031198053836302721556-2732-1366.jpg",
    "publishedAt": "2018-10-15T21:22:33Z",
    "content": "Saudi journalist Jamal Khashoggi had a long, complicated career before he went missing in early October. Khashoggi, who was a US resident and wrote for The Washington Post, disappeared on October 2 after entering the Saudi consulate in Istanbul to obtain docu… [+6432 chars]"
  },
  {
    "source": {
      "id": "the-wall-street-journal",
      "name": "The Wall Street Journal"
    },
    "author": "David Gauthier-Villars",
    "title": "Missing Saudi Journalist Was Killed in Consulate, Turkish Police Say - Wall Street Journal",
    "description": "Wall Street Journal Missing Saudi Journalist Was Killed in Consulate, Turkish Police Say Wall Street Journal ISTANBUL—Turkish police believe the Saudi journalist gone missing earlier this week was killed inside the kingdom's consulate in Istanbul before his b…",
    "url": "https://www.wsj.com/articles/missing-saudi-journalist-was-killed-in-consulate-turkish-police-say-1538897699",
    "urlToImage": "https://images.wsj.net/im-29748/social",
    "publishedAt": "2018-10-07T07:34:00Z",
    "content": "ISTANBULTurkish police believe the Saudi journalist gone missing earlier this week was killed inside the kingdoms consulate in Istanbul before his body was spirited out of the building, Turkish officials said, accusations that could further inflame relations … [+5384 chars]"
  },
  {
    "source": {
      "id": "time",
      "name": "Time"
    },
    "author": "Associated Press",
    "title": "‘Those Responsible Will Be Held to Account.’ Saudi Arabia Foreign Minister Promises Truth From Khashoggi Probe",
    "description": "Saudi Arabia's foreign minister says the investigation into the killing of journalist Jamal Khashoggi will produce the truth about what happened",
    "url": "http://time.com/5431677/saudi-arabia-foreign-minister-khashoggi-probe/",
    "urlToImage": "https://timedotcom.files.wordpress.com/2018/10/gettyimages-1052430210.jpg?quality=85",
    "publishedAt": "2018-10-23T06:47:06Z",
    "content": "(JAKARTA, Indonesia) — Saudi Arabia’s foreign minister says the investigation into the killing of journalist Jamal Khashoggi will produce the truth about what happened. He also pledged that mechanisms will be put in place so that “something like this can neve… [+573 chars]"
  },
  {
    "source": {
      "id": "the-huffington-post",
      "name": "The Huffington Post"
    },
    "author": "S.V. Date",
    "title": "Trump Calls Media ‘Enemy Of The People.’ Maybe The Saudis Took Him Literally.",
    "description": "Jamal Khashoggi’s fate may be tied to the president’s habit of attacking the press, now mimicked by autocrats worldwide.",
    "url": "https://www.huffingtonpost.com/entry/trump-enemy-of-the-people-saudi-arabia_us_5bbfb704e4b0bd9ed5583931",
    "urlToImage": "https://img.huffingtonpost.com/asset/5bbfb7f33c000066000e1941.jpeg?cache=rTRi7ItZAE&ops=1200_630",
    "publishedAt": "2018-10-11T23:02:46Z",
    "content": "WASHINGTON The American president who has made a habit of calling news media “the enemy of the people” is now facing a possible consequence of his words: the disappearance, perhaps murder, of a Washington-based journalist at the hands of one of the president’… [+5727 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Slate.com"
    },
    "author": "Joshua Keating, Joshua Keating",
    "title": "Who Will Win the 2018 Nobel Peace Prize?",
    "description": "Why almost everyone stands a better chance at winning than Donald Trump.",
    "url": "https://slate.com/news-and-politics/2018/10/nobel-peace-prize-2018-predictions-moon-jae-in-kim-jong-un-george-soros.html",
    "urlToImage": "https://compote.slate.com/images/78b634e2-6515-4480-85fc-0e4286362a1f.jpeg?width=780&height=520&rect=1560x1040&offset=0x0",
    "publishedAt": "2018-10-03T21:18:36Z",
    "content": "What Kavanaughs Drinking Tells Us About His Credibility Theres Nothing Like Seeing a Headline About the President Inheriting a Fortune via Fraud and Knowing Hell Definitely Get Away With It New Book: McConnell Threatened to Frame Pre-Election Intelligence Abo… [+7292 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Marketwatch.com"
    },
    "author": "Mark DeCambre",
    "title": "Market Snapshot: Dow poised to jump 100 points at the open as stock market aims to follow China rebound",
    "description": "U.S. stocks appear set to kick of Friday trade solidly higher as a rebound in China’s main equity benchmarks assuage dread about waning global growth, even as Beijing reports the worst rate of economic expansion since 2009.",
    "url": "https://www.marketwatch.com/story/dow-poised-to-jump-100-points-at-the-open-as-stock-market-aims-to-follow-china-rebound-2018-10-19",
    "urlToImage": "http://s.marketwatch.com/public/resources/MWimages/MW-FW118_1987_w_MG_20171012091026.jpg",
    "publishedAt": "2018-10-19T12:20:38Z",
    "content": "U.S. stocks appeared set to kick of Friday trade solidly higher as a rebound in Chinas main equity benchmarks assuaged dread about waning global growth, even as Beijing reported the worst rate of economic expansion since 2009. Fridays action also comes on the… [+4592 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Jalopnik.com"
    },
    "author": "Michael Ballaban",
    "title": "Ford's Layoff Plan Is Making A Ton Of People Nervous: Report",
    "description": "Ford’s looming layoffs, a Chinese electric car company is actually selling cars, and Sears is nearly dead. This is The Morning Shift for October 15, 2018. Read more...",
    "url": "https://jalopnik.com/fords-layoff-plan-is-making-a-ton-of-people-nervous-re-1829751888",
    "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--b4Vojh0q--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/dum7faxja5lfndedzbsa.jpg",
    "publishedAt": "2018-10-15T14:23:00Z",
    "content": "Fords looming layoffs, a Chinese electric car company is actually selling cars, and Sears is nearly dead. This is The Morning Shift for October 15, 2018. 1st Gear: Ford In Trouble Layoffs suck, obviously, but theres usually a standard methodology to it. The b… [+8773 chars]"
  },
  {
    "source": {
      "id": "al-jazeera-english",
      "name": "Al Jazeera English"
    },
    "author": "Al Jazeera",
    "title": "Khashoggi on life under MBS: 'Nobody dares to speak'",
    "description": "In his last interview with Al Jazeera UpFront, the Saudi journalist spoke on the need for debate in Saudi Arabia.",
    "url": "https://www.aljazeera.com/indepth/features/khashoggi-life-mbs-dares-speak-181010065141849.html",
    "urlToImage": "https://www.aljazeera.com",
    "publishedAt": "2018-10-10T13:47:43Z",
    "content": "With a growing chorus of global leaders calling for an investigation into the disappearance and alleged murder of Saudi journalist Jamal Khashoggi inside Riyadh's consulate in Istanbul last week, Al Jazeera's UpFront looks back to a March interview with the m… [+30235 chars]"
  },
  {
    "source": {
      "id": "al-jazeera-english",
      "name": "Al Jazeera English"
    },
    "author": "Al Jazeera",
    "title": "Mohammed bin Salman: The dark side of Saudi Arabia's crown prince",
    "description": "Touted as Saudi Arabia's progressive reformer, Mohammed bin Salman has an ominous human rights record.",
    "url": "https://www.aljazeera.com/news/2018/10/mohammed-bin-salman-dark-side-saudi-arabia-crown-prince-181015123719153.html",
    "urlToImage": "https://www.aljazeera.com/mritems/Images/2018/10/15/5fdd98e8a37f4a6694195194d883149a_18.jpg",
    "publishedAt": "2018-10-15T19:37:35Z",
    "content": "The disappearance of Saudi journalist Jamal Khashoggi has put the spotlight on Saudi Arabia's Crown Prince Mohammed bin Salman, or MBS. Since he outmaneuvered his rivals to become Saudi Arabia's de-facto leader in 2015, the 33-year-old has received favourable… [+15453 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Qz.com"
    },
    "author": "Tim Fernholz",
    "title": "Donald Trump put a $110-billion price on Jamal Kashoggi’s life",
    "description": "For the US president, it's a simple calculus: Arms deals over disrupting his administration's relationship with the kingdom. But his numbers don't add up.",
    "url": "https://qz.com/1424804/saudi-arabias-money-means-more-to-trump-than-kashoggis-life/",
    "urlToImage": "https://cms.qz.com/wp-content/uploads/2018/10/Donald-Trump-Jamal-Kashoggi-Saudi-Arabia-yemen-arms-weapons-sales.jpg?quality=75&strip=all&w=1400",
    "publishedAt": "2018-10-15T19:18:24Z",
    "content": "Donald Trump explained succinctly last week why he wont do much about the apparent murder of a US permanent resident by the Saudi Arabian government. We dont like it even a little bit. But as to whether or not we should stop $110 billion from being spent in t… [+4003 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Qz.com"
    },
    "author": "Annabelle Timsit",
    "title": "All the most important details from Erdogan’s speech about the murder of Jamal Khashoggi",
    "description": "The murder of Saudi journalist Jamal Khashoggi inside the Saudi consulate in Istanbul on Oct. 2 has sparked an international crisis that came to an…",
    "url": "https://qz.com/1433388/what-erdogans-speech-tells-us-about-khashoggis-murder/",
    "urlToImage": "https://cms.qz.com/wp-content/uploads/2018/10/All-the-most-important-details-from-Erdogans-speech-e1540288855438.jpg?quality=75&strip=all&w=1400",
    "publishedAt": "2018-10-23T11:05:42Z",
    "content": "The murder of Saudi journalist Jamal Khashoggi inside the Saudi consulate in Istanbul on Oct. 2 has sparked an international crisis that came to an underwhelming head this morning (Oct. 23) with a parliamentary speech by Turkish president Recep Tayyip Erdoan.… [+2943 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thinkprogress.org"
    },
    "author": "Joshua Eaton",
    "title": "Report: Saudi Arabia murdered journalist inside its consulate in Turkey",
    "description": "Saudi Arabia murdered dissident journalist Jamal Khashoggi inside its consulate in Istanbul, unnamed Turkish officials told Reuters and The Washington Post. “We believe that the murder was premeditated and the body was subsequently moved out of the consulate,…",
    "url": "https://thinkprogress.org/report-saudi-arabia-murdered-journalist-inside-its-consulate-in-turkey-1f083e4b45b9/",
    "urlToImage": "https://thinkprogress.org/wp-content/uploads/2018/10/GettyImages-1045908588.jpg?w=1280&h=720&crop=1",
    "publishedAt": "2018-10-07T17:39:46Z",
    "content": "Saudi Arabia murdered dissident journalist Jamal Khashoggi inside its consulate in Istanbul, unnamed Turkish officials told Reuters and The Washington Post. “We believe that the murder was premeditated and the body was subsequently moved out of the consulate,… [+3721 chars]"
  },
  {
    "source": {
      "id": "al-jazeera-english",
      "name": "Al Jazeera English"
    },
    "author": "Jamal Elshayyal",
    "title": "Saudi Arabia denies killing of Kashoggi inside Turkey consulate",
    "description": "Turkish security sources say the missing journalist may have been killed and his body moved out of the consulate.",
    "url": "https://www.aljazeera.com/news/2018/10/saudi-arabia-denies-killing-kashoggi-turkey-consulate-181007151205783.html",
    "urlToImage": "/mritems/images/2018/10/7/665003303001_5845571819001_5845557503001-th.jpg",
    "publishedAt": "2018-10-07T15:12:05Z",
    "content": "Jamal Khashoggi has been missing for five days. \"The initial assessment of the Turkish police is that Mr Khashoggi has been killed at the consulate of Saudi Arabia in Istanbul. We believe that the murder was premeditated and the body was subsequently moved ou… [+464 chars]"
  },
  {
    "source": {
      "id": "business-insider",
      "name": "Business Insider"
    },
    "author": "Shona Ghosh",
    "title": "The fate of missing journalist Jamal Khashoggi hangs over SoftBank as it looks to raise another $100 billion fund",
    "description": "Japanese conglomerate and tech investor SoftBank is under scrutiny over its ties to Saudi Arabia, a major backer of its $100 billion Vision Fund. That is thanks to global outcry over the status of missing Saudi journalist Jamal Khashoggi, who is feared dead a…",
    "url": "https://www.businessinsider.com/jamal-khashoggi-softbank-second-100-billion-fund-2018-10",
    "urlToImage": "https://amp.businessinsider.com/images/5bc85c217e423910941fd203-1920-960.jpg",
    "publishedAt": "2018-10-18T11:16:16Z",
    "content": "Japanese conglomerate SoftBank is under intense scrutiny over its plans to raise a second $100 billion technology investment fund with $45 billion from Saudi Arabia. SoftBank is already one of the world's biggest tech investors through its first Vision Fund, … [+1758 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Indianexpress.com"
    },
    "author": "Bloomberg",
    "title": "Donald Trump demands answers from Saudi ally about missing journalist Jamal Khashoggi",
    "description": "Donald Trump said that Khashoggi’s fiancée had sent him a letter and may come to the White House soon.",
    "url": "https://indianexpress.com/article/world/donald-trump-demands-answers-from-saudi-ally-about-missing-journalist-jamal-khashoggi-5396292/",
    "urlToImage": "https://images.indianexpress.com/2018/10/khashoggi-1.jpg?w=759",
    "publishedAt": "2018-10-10T17:29:23Z",
    "content": "By: Bloomberg | Published: October 10, 2018 10:59:23 pm FILE – In this Feb. 1, 2015, file photo, Saudi journalist Jamal Khashoggi speaks during a press conference in Manama, Bahrain.(AP) President Donald Trump said he has spoken with Saudi Arabia at the highe… [+3222 chars]"
  },
  {
    "source": {
      "id": "reuters",
      "name": "Reuters"
    },
    "author": "Reuters Editorial",
    "title": "UAE voices support for Saudi king statement on journalist's death: WAM",
    "description": "The United Arab Emirates on Saturday backed Saudi Arabia's statement about the death of Saudi journalist Jamal Khashoggi, the official news agency WAM said.",
    "url": "https://www.reuters.com/article/us-saudi-khashoggi-emirates/uae-voices-support-for-saudi-king-statement-on-journalists-death-wam-idUSKCN1MU0CO",
    "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png",
    "publishedAt": "2018-10-20T09:50:43Z",
    "content": "DUBAI (Reuters) - The United Arab Emirates on Saturday backed Saudi Arabia’s statement about the death of Saudi journalist Jamal Khashoggi, the official news agency WAM said. The Gulf Arab state “commends directives and decisions of Saudi King Salman on the i… [+305 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Nakedcapitalism.com"
    },
    "author": "Lambert Strether",
    "title": "Links 10/15/18",
    "description": "Our popular daily links, including Sears, equities, Google and carbon, Bitcoin, climate change, Brexit mandarins, German elections, Kashoggi scandal, Trump on 60 minutes, financial toxicity of cancer, the liberal world order, billionaires, textiles",
    "url": "https://www.nakedcapitalism.com/2018/10/links-10-15-18.html",
    "urlToImage": "https://www.nakedcapitalism.com/wp-content/uploads/2018/10/cat_couple.jpg",
    "publishedAt": "2018-10-15T10:55:18Z",
    "content": "This is Naked Capitalism fundraising week. 694 donors have already invested in our efforts to combat corruption and predatory conduct, particularly in the financial realm. Please join us and participate via our donation page, which shows how to give via check… [+5533 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Nakedcapitalism.com"
    },
    "author": "Lambert Strether",
    "title": "Links 10/16/18",
    "description": "Our popular daily links, including cheese, hurricanes, climate change, the F-22, no-deal Brexit, the Kashoggi affair, Syria, Bezos, Eric Holder, affluent cities, Uber, Apple, Big Tech",
    "url": "https://www.nakedcapitalism.com/2018/10/links-10-16-18.html",
    "urlToImage": "https://www.nakedcapitalism.com/wp-content/uploads/2018/10/racoon_2.jpg",
    "publishedAt": "2018-10-16T10:55:56Z",
    "content": "This is Naked Capitalism fundraising week. 817 donors have already invested in our efforts to combat corruption and predatory conduct, particularly in the financial realm. Please join us and participate via our donation page, which shows how to give via check… [+5915 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Nakedcapitalism.com"
    },
    "author": "Lambert Strether",
    "title": "Links 10/14/18",
    "description": "Our popular daily links, including nuts for the winter, Hurricane Michael, climate change, Goldman Sachs, Vanguard, Brexit machinations, the Saudis and Kashoggi, India, liberals, Medicare for All, \"good men,\" Amazon, ICANN, soil",
    "url": "https://www.nakedcapitalism.com/2018/10/links-10-14-18.html",
    "urlToImage": "https://www.nakedcapitalism.com/wp-content/uploads/2018/10/hawk_2.jpg",
    "publishedAt": "2018-10-14T10:55:58Z",
    "content": "This is Naked Capitalism fundraising week. 552 donors have already invested in our efforts to combat corruption and predatory conduct, particularly in the financial realm. Please join us and participate via our donation page, which shows how to give via check… [+7201 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes.com"
    },
    "author": "Michael Lynch, Contributor, Michael Lynch, Contributor https://www.forbes.com/sites/michaellynch/",
    "title": "Is The Oil Weapon Rearing Its Ugly Head In The Kashoggi Affair?",
    "description": "The war of words between Saudi Arabia and the U.S. is unlikely to see the appearnce of the 'oil weapon'",
    "url": "https://www.forbes.com/sites/michaellynch/2018/10/15/is-the-oil-weapon-rearing-its-ugly-head-in-the-kashoggi-affair/",
    "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F1051742846%2F960x0.jpg%3Ffit%3Dscale",
    "publishedAt": "2018-10-15T14:51:00Z",
    "content": "Share to facebook Share to twitter Share to linkedin Close-up of a small bronze statuette of Lady Justice before a Saudi Arabian flag. This morning, oil prices were up for a while based on the perceived threat by Saudi Arabia to employ its oil weapon against … [+6552 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Forbes.com"
    },
    "author": "Melik Kaylan, Contributor, Melik Kaylan, Contributor https://www.forbes.com/sites/melikkaylan/",
    "title": "The Secret History Of The Saudi Consulate Affair: Turkey's Counter-Attack",
    "description": "The Turks released Brunson, but on the same day they started to leak the details of Kashoggi's disappearance. Ankara to the White House: we can wreck your economy too, watch this. To the tune of (in President Trump's estimate) losing $100 billion worth of Sau…",
    "url": "https://www.forbes.com/sites/melikkaylan/2018/10/18/the-secret-history-of-the-saudi-consulate-affair-turkeys-counter-attack/",
    "urlToImage": "https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fspecials-images.forbesimg.com%2Fdam%2Fimageserve%2F597647006%2F960x0.jpg%3Ffit%3Dscale",
    "publishedAt": "2018-10-19T00:00:00Z",
    "content": "Almost everything we know about what actually happened in the Saudi Consulate comes from the Turks. Make that everything we know. And make that what we think we know. One thing is certain at this point. The US-based Saudi journalist Jamal Kashoggi is dead. Th… [+11534 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Bbc.com"
    },
    "author": "https://www.facebook.com/bbcnews",
    "title": "Jamal Khashoggi: Branson halts $1bn Saudi investment talks - BBC News",
    "description": "BBC News Jamal Khashoggi: Branson halts $1bn Saudi investment talks BBC News Sir Richard Branson has halted talks over $1bn Saudi investment in Virgin space firms after the disappearance of Saudi journalist Jamal Khashoggi. Sir Richard has also suspended dire…",
    "url": "https://www.bbc.com/news/business-45833910",
    "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/E4F5/production/_103831685_branson.jpg",
    "publishedAt": "2018-10-12T07:18:45Z",
    "content": "Image copyright Rob Kim Sir Richard Branson has halted talks over $1bn Saudi investment in Virgin space firms after the disappearance of Saudi journalist Jamal Khashoggi. Sir Richard has also suspended directorships in two tourism projects. Mr Khashoggi, a no… [+2560 chars]"
  },
  {
    "source": {
      "id": "nbc-news",
      "name": "NBC News"
    },
    "author": null,
    "title": "Screenshots show Khashoggi did not see text messages after entering Saudi consulate",
    "description": "Saudi dissident Jamal Khashoggi checked his phone before entering the Saudi consulate in Istanbul, but didn't see messages sent minutes later.",
    "url": "https://www.nbcnews.com/news/world/screenshots-show-khashoggi-did-not-see-text-messages-after-entering-n918856",
    "urlToImage": "https://static.euronews.com/articles/3370370/1000x563_3370370.jpg",
    "publishedAt": "2018-10-11T08:30:59Z",
    "content": "WASHINGTON Missing Saudi journalist Jamal Khashoggi checked his cellphone just before entering the Saudi consulate in Istanbul last week, but never read messages sent to him minutes later, screenshots obtained by NBC News show. The screenshots of WhatsApp mes… [+5877 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo.com"
    },
    "author": null,
    "title": "Turkey summons Saudi ambassador over missing journalist - Yahoo News",
    "description": "Yahoo News Turkey summons Saudi ambassador over missing journalist Yahoo News Saudi Arabia's ambassador to Turkey was summoned to the foreign ministry after a prominent journalist critical of Riyadh went missing, a Turkish diplomatic source said on Thursday. …",
    "url": "https://au.news.yahoo.com/turkey-summons-saudi-ambassador-over-missing-journalist-115051243--spt.html",
    "urlToImage": "https://s.yimg.com/uu/api/res/1.2/fHDcDMVBIcSJX69u2g5lqw--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_AU/Sports/Agence-FrancePresse/adfaa6385306981a23748f77a561f47300ea9ec5.jpg",
    "publishedAt": "2018-10-04T11:58:56Z",
    "content": "Saudi Arabia's ambassador to Turkey was summoned to the foreign ministry after a prominent journalist critical of Riyadh went missing, a Turkish diplomatic source said on Thursday. Jamal Khashoggi, a contributor to the Washington Post, went to the Saudi consu… [+1731 chars]"
  },
  {
    "source": {
      "id": "nbc-news",
      "name": "NBC News"
    },
    "author": "Alastair Jamieson, Kristina Jovanovski, Associated Press, Reuters",
    "title": "Khashoggi mystery exposes rifts between US allies Turkey, Saudi Arabia - NBCNews.com",
    "description": "NBCNews.com Khashoggi mystery exposes rifts between US allies Turkey, Saudi Arabia NBCNews.com LONDON — The mysterious disappearance of Washington Post contributor Jamal Khashoggi marks not only a low point for global press freedom but also a widening fault l…",
    "url": "https://www.nbcnews.com/news/world/khashoggi-mystery-exposes-rifts-between-u-s-allies-turkey-saudi-n918431",
    "urlToImage": "https://media3.s-nbcnews.com/j/newscms/2018_41/2598836/181010-kashoggi-embassy-mc-854_e463122da75a9f2d0afee8c056d9a1dd.1200;630;7;70;5.JPG",
    "publishedAt": "2018-10-10T09:46:00Z",
    "content": "Neither the Turks nor the Saudis are credible, said Steven A. Cook, a senior fellow for Middle East and Africa Studies at the Council on Foreign Relations. Both have sought to delegitimize domestic and international critics with propaganda, half-truths and ou… [+6171 chars]"
  },
  {
    "source": {
      "id": "reuters",
      "name": "Reuters"
    },
    "author": "Mark John",
    "title": "Daily Briefing: Merkel allies suffer in Bavaria - Reuters",
    "description": "Montreal Gazette Daily Briefing: Merkel allies suffer in Bavaria Reuters LONDON (Reuters) - How toxic is it to be in Angela Merkel's coalition? Certainly both her partners performed poorly in yesterday's Bavarian election, with the right-wing CSU losing its a…",
    "url": "https://uk.reuters.com/article/uk-europe-view-monday/daily-briefing-merkel-allies-suffer-in-bavaria-idUKKCN1MP0MX",
    "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20181015&t=2&i=1314877283&w=1200&r=LYNXNPEE9E0DT",
    "publishedAt": "2018-10-15T07:42:52Z",
    "content": "LONDON (Reuters) - How toxic is it to be in Angela Merkel's coalition? Certainly both her partners performed poorly in yesterday's Bavarian election, with the right-wing CSU losing its accustomed majority and the centre-left slipping below 10 percent. The eme… [+6347 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Theblaze.com"
    },
    "author": "Teri Webster",
    "title": "Under growing pressure, Saudi senior official offers yet another explanation for Khashoggi death",
    "description": "A senior Saudi Arabia official on Sunday offered Reuters news yet another explanation for the death of journalist Jamal Khashoggi at the Saudi consulate in Istanbul earlier this month.What’s the latest story?The official claims a team of 15 men acted without …",
    "url": "https://www.theblaze.com/news/2018/10/21/under-growing-pressure-saudi-senior-official-offers-yet-another-explanation-for-khashoggi-death",
    "urlToImage": "https://www.theblaze.com/wp-content/uploads/2018/10/jamal-khashoggi-10.19-1280x720.jpg",
    "publishedAt": "2018-10-21T17:14:21Z",
    "content": "A senior Saudi Arabia official on Sunday offered Reuters news yet another explanation for the death of journalist Jamal Khashoggi at the Saudi consulate in Istanbul earlier this month. Whats the latest story? The official claims a team of 15 men acted without… [+3184 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thedailybeast.com"
    },
    "author": "By andrew.kirell@thedailybeast.com (Andrew Kirell)",
    "title": "Fox News Spent the Past Week Repeatedly Emphasizing Jamal Khashoggi Once Supported the Muslim Brotherhood",
    "description": "Photo Illustration by The Daily Beast As it becomes clearer the de facto ruler of Saudi Arabia was behind the gruesome torture, murder, and dismemberment of Washington Post columnist Jamal Khashoggi, President Trump’s allies have ramped up efforts to paint hi…",
    "url": "https://www.thedailybeast.com/fox-news-spent-the-past-week-repeatedly-emphasizing-jamal-khashoggi-once-supported-the-muslim-brotherhood",
    "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1539974770/181019-Fox-Khashoggi-tease_rzdez9",
    "publishedAt": "2018-10-19T18:55:59Z",
    "content": "As it becomes clearer the de facto ruler of Saudi Arabia was behind the gruesome torture, murder, and dismemberment of Washington Post columnist Jamal Khashoggi, President Trumps allies have ramped up efforts to paint him as a terrorist sympathizer. On Thursd… [+5833 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Snopes.com"
    },
    "author": "Bethania Palma",
    "title": "Did President Trump Strong Arm Qatar Into Bailing Out Jared Kushner?",
    "description": "The president's son-in-law reportedly owes a $1 billion-plus mortgage on a building he purchased on Fifth Avenue in 2007.",
    "url": "https://www.snopes.com/fact-check/trump-kushner-qatar/",
    "urlToImage": "https://us-east-1.tchyn.io/snopes-production/uploads/2018/10/corruption.jpg",
    "publishedAt": "2018-10-18T19:14:32Z",
    "content": "CLAIM President Donald Trump and Jared Kushner have used their public offices to manipulate Gulf countries for personal gain. RATING ORIGIN In October 2018, social media users shared a meme posted by the liberal Facebook page Occupy Democrats reporting a seri… [+5231 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thestar.com"
    },
    "author": "Tonda MacCharles - Ottawa Bureau",
    "title": "Trudeau hints at freezing arms export permits to Saudi Arabia in wake of Kashoggi death",
    "description": "Prime minister says his government is working with G7 allies to coordinate a response to the Washington Post journalist’s death.",
    "url": "https://www.thestar.com/politics/federal/2018/10/22/trudeau-hints-at-freezing-arms-export-permits-to-saudi-arabia-in-wake-of-kashoggi-death.html",
    "urlToImage": "https://images.thestar.com/WxlCrVNnXLMKdXGpSd9qFodCmnI=/753x1200/smart/filters:cb(1540264479378)/https://www.thestar.com/content/dam/thestar/politics/federal/2018/10/22/trudeau-hints-at-freezing-arms-export-permits-to-saudi-arabia-in-wake-of-kashoggi-death/kashoggi.jpg",
    "publishedAt": "2018-10-22T22:48:36Z",
    "content": "OTTAWA—Prime Minister Justin Trudeau suggested Monday his government is looking at freezing export permits to Saudi Arabia as pressure mounted on the Canadian government to follow Germany’s lead and suspend arms sales in the wake of the murder of Washington P… [+4134 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Cleantechnica.com"
    },
    "author": "Tina Casey",
    "title": "The Kashoggi Murder: Clean Tech Stakeholders Take A Stand",
    "description": "As the global uproar grows over the Jamal Kashoggi murder, Saudi Arabia's jewel-in-the-crown clean tech megacity Neom is caught in the crossfire",
    "url": "https://cleantechnica.com/2018/10/16/the-kashoggi-murder-clean-tech-stakeholders-take-a-stand/",
    "urlToImage": "https://cleantechnica.com/files/2018/10/Kashoggi-clean-tech-renewable-energy.png",
    "publishedAt": "2018-10-16T15:04:04Z",
    "content": "Clean Power Published on October 16th, 2018 | by Tina Casey 0 October 16th, 2018 by Tina Casey The list just keeps on growing, as global companies join together in protest of the murder of journalist Jamal Kashoggi inside the Saudi consulate in Istanbul, Turk… [+5202 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Juancole.com"
    },
    "author": "Daniel Martin Varisco",
    "title": "Kashoggi, Yemen and the War on Journalism",
    "description": "(MENA Tidningen) - For the past week, the news cycle on the Middle East has been focused, for obvious reasons, on the murder of the Saudi journalist Jamal Kashoggi in the Saudi consulate in Istanbul on October 2. Turkish authorities claim that they have hard …",
    "url": "https://www.juancole.com/2018/10/kashoggi-yemen-journalism.html",
    "urlToImage": "/images/2018/10/samer.jpg",
    "publishedAt": "2018-10-18T04:23:28Z",
    "content": "(MENA Tidningen) – For the past week, the news cycle on the Middle East has been focused, for obvious reasons, on the murder of the Saudi journalist Jamal Kashoggi in the Saudi consulate in Istanbul on October 2. Turkish authorities claim that they have hard … [+6022 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thestranger.com"
    },
    "author": "Lester Black",
    "title": "Weekday Trumpdate: Trump Admits Khashoggi Is Dead, Golfs Instead of Visiting Troops, Is Still Terrible",
    "description": "Trump is still president. He's also still a grifter that lies about everything and wants to take health insurance away from poor people. Sorry. by Lester Black Chip Somodevilla / Staff • As the world learns more gruesome details about the assassination of Was…",
    "url": "https://www.thestranger.com/slog/2018/10/18/34100073/weekday-trumpdate-trump-admits-khashoggi-is-dead-golfs-instead-of-visiting-troops-is-still-terrible",
    "urlToImage": "https://media2.fdncms.com/stranger/imager/u/large/34102024/1539910476-gettyimages-1056467020.jpg",
    "publishedAt": "2018-10-19T00:50:17Z",
    "content": "As the world learns more gruesome details about the assassination of Washington Post columnist Jamal Khashoggi (chopped fingers, torture, dismembered limbs, a plea from the Saudi consul general to \"do this outside\") Trump has used the world's greatest intelli… [+3385 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thestranger.com"
    },
    "author": "Rich Smith",
    "title": "Kim Schrier Won Her Only Debate Against Dino Rossi",
    "description": "We're still voting for Kim now. by Rich Smith We're all still voting for Kim now. RS Last night I learned two things at the one and only debate between Democrat Kim Schrier and anti-gay, anti-choice, anti-immigrant Republican Dino Rossi. 1.) Central Washingto…",
    "url": "https://www.thestranger.com/slog/2018/10/18/34092243/kim-schrier-won-her-only-debate-against-dino-rossi",
    "urlToImage": "https://media2.fdncms.com/stranger/imager/u/large/34092254/1539887519-kim_stans.jpg",
    "publishedAt": "2018-10-18T19:20:00Z",
    "content": "Last night I learned two things at the one and only debate between Democrat Kim Schrier and anti-gay, anti-choice, anti-immigrant Republican Dino Rossi. 1.) Central Washington University's campus in Ellensburg is really lovely in the fall! 2.) Schrier can han… [+8188 chars]"
  },
  {
    "source": {
      "id": "cbs-news",
      "name": "CBS News"
    },
    "author": "Holly Rosenkrantz",
    "title": "Paul Ryan says journalist's fate \"disturbing\" but U.S.-Saudi ties will \"persist\"",
    "description": "House Speaker Paul Ryan, in a \"CBS This Morning\" interview, says ties with Saudi Arabia will endure despite Kashoggi situation",
    "url": "https://www.cbsnews.com/news/paul-ryan-jamal-kashoggi-fate-disturbing-but-us-saudi-ties-will-persist/",
    "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2018/10/17/045bc430-b456-4379-a1c3-c89816b24126/thumbnail/1200x630/93cbe5c13a915c761bd081b9f36b3e4c/1017-ctm-jdpaulryan-1686918-640x360.jpg",
    "publishedAt": "2018-10-16T19:43:39Z",
    "content": "House Speaker Paul Ryan said Wednesday that the disappearance and alleged killing of Saudi journalist Jamal Khashoggi is \"really disturbing\" and could be problematic for the U.S.-Saudi relationship. However, in the interview with \"CBS This Morning\" co-host Jo… [+2058 chars]"
  },
  {
    "source": {
      "id": "cbs-news",
      "name": "CBS News"
    },
    "author": "Kate Gibson",
    "title": "Richard Branson drops Saudi deals after journalist disappears",
    "description": "Richard Branson, Steve Case, Uber's  Dara Khosrowshahi among Western execs avoiding projects touting Saudi investment",
    "url": "https://www.cbsnews.com/news/business-leaders-cancel-saudi-events-ask-crown-prince-mohammed-bin-salmon-for-info-on-jamal-koshoggi-disappearace/",
    "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2014/09/26/78efbe1e-4751-4910-bcd2-551d5acf567d/thumbnail/1200x630/9ac57de3137e58d6c10d8357d813f8ed/455045540.jpg",
    "publishedAt": "2018-10-12T13:01:20Z",
    "content": "Virgin Group founder Richard Branson has joined such prominent Western business leaders as technology investor Steve Case and Uber CEO Dara Khosrowshahi in backing away from projects with Saudi Arabia after the disappearance and alleged killing of journalist … [+2864 chars]"
  },
  {
    "source": {
      "id": "cbs-news",
      "name": "CBS News"
    },
    "author": "MoneyWatch",
    "title": "Dow slides more than 500 points as market selloff resumes",
    "description": "Stocks are pulling back as rising geopolitical risks, tariff impact weigh on investor sentiment",
    "url": "https://www.cbsnews.com/news/why-are-stocks-down-today-dow-jones-2018-10-23/",
    "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/10/12/990dfa19-d0f5-4a54-84de-bc02c9748c5c/thumbnail/1200x630/5c13d3b53494c7339bd840771ff722f6/nyse-gettyimages-1051906544.jpg",
    "publishedAt": "2018-10-23T14:23:09Z",
    "content": "NEW YORK - Stocks slid Tuesday, with investors pulling back amid signs that corporate profits are cresting and potential threats to global economic growth. The Dow was down more than 500 points, or nearly 2 percent, in early trade, while the S&amp;P 500 and N… [+1364 chars]"
  },
  {
    "source": {
      "id": "cbs-news",
      "name": "CBS News"
    },
    "author": "MoneyWatch",
    "title": "Dow slides more than 500 points as market selloff resumes",
    "description": "Stocks are pulling back as rising geopolitical risks, tariff impact weigh on investor sentiment",
    "url": "https://www.cbsnews.com/news/dow-slides-more-than-500-points-as-market-selloff-resumes/",
    "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/10/12/990dfa19-d0f5-4a54-84de-bc02c9748c5c/thumbnail/1200x630/5c13d3b53494c7339bd840771ff722f6/nyse-gettyimages-1051906544.jpg",
    "publishedAt": "2018-10-23T14:23:09Z",
    "content": "NEW YORK - Stocks slid Tuesday, with investors pulling back amid signs that corporate profits are cresting and potential threats to global economic growth. The Dow was down more than 500 points, or nearly 2 percent, in early trade, while the S&amp;P 500 and N… [+890 chars]"
  },
  {
    "source": {
      "id": "abc-news-au",
      "name": "ABC News (AU)"
    },
    "author": "John Barron",
    "title": "What's the deal with Trump and Saudi Arabia?",
    "description": "Donald Trump has vowed \"severe punishment\" if the Saudi rulers had journalist Jamal Kashoggi assassinated. But what could that punishment look like, when a $US100 billion rms deal hangs in the balance?",
    "url": "http://www.abc.net.au/news/2018-10-15/donald-trump-responds-to-jamal-kashoggis-disappearance/10377382",
    "urlToImage": "http://www.abc.net.au/news/image/9703762-16x9-700x394.jpg",
    "publishedAt": "2018-10-15T03:05:14Z",
    "content": "Updated October 15, 2018 14:17:19 US President Donald Trump has vowed \"severe punishment\" if agents of Saudi Arabia's rulers killed Washington Post columnist Jamal Khashoggi. But what would that punishment look like? Would it involve sanctions, as suggested b… [+5060 chars]"
  },
  {
    "source": {
      "id": "msnbc",
      "name": "MSNBC"
    },
    "author": "MSNBC.com",
    "title": "Jared Kushner's role in Saudi Arabia's alliance with the U.S.",
    "description": "Secretary of State Mike Pompeo is heading to Saudi Arabia after the king denies any involvement in the disappearance of journalist Jamal Kashoggi. Chris Jansing is joined by MSNBC Political Analyst Philip Rucker to discuss that disappearance and the role Jare…",
    "url": "https://www.msnbc.com/stephanie-ruhle/watch/jared-kushner-s-role-in-saudi-arabia-s-alliance-with-the-u-s-1344473667890",
    "urlToImage": "https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201810/n_ruhle_b2block_181015_1920x1080.1200;630;7;70;5.jpg",
    "publishedAt": "2018-10-15T14:45:34Z",
    "content": null
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo.com"
    },
    "author": null,
    "title": "Turkey: Saudi hunt for Kashoggi killers must go 'top to bottom'",
    "description": "Tayyip Erdogan stopped short of mentioning Crown Prince Mohammed bin Salman, the powerful de facto ruler of Saudi Arabia who some U.S. lawmakers suspect ordered the killing of Washington Post columnist Jamal Khashoggi. Turkish officials suspect Khashoggi, a U…",
    "url": "https://www.yahoo.com/news/savage-khashoggi-killing-planned-turkeys-leader-103051869.html",
    "urlToImage": "https://s.yimg.com/uu/api/res/1.2/KqTKwiIZsaIUCTjH2VfU5w--~B/aD0zMDk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/Reuters/2018-10-23T120731Z_2_LYNXNPEE9M0QP_RTROPTP_2_SAUDI-KHASHOGGI-TURKEY-ERDOGAN.JPG",
    "publishedAt": "2018-10-23T14:47:40Z",
    "content": "By Gulsen Solaker and Ece Toksabay ANKARA (Reuters) - Turkey's president on Tuesday dismissed Saudi Arabia's efforts to blame the killing of a prominent journalist on rogue operatives, calling it a planned, \"savage killing\", and demanded Riyadh punish those r… [+5619 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo.com"
    },
    "author": null,
    "title": "The Latest: Erdogan says Saudis planned writer's murder",
    "description": "ANKARA, Turkey (AP) — The Latest on the killing of Saudi writer Jamal Khashoggi (all times local):",
    "url": "https://www.yahoo.com/news/latest-turkey-cooperate-international-probe-075018458.html",
    "urlToImage": "https://s.yimg.com/uu/api/res/1.2/9Gpfl_C3uZE95MlOKnJQAg--~B/aD0zMDAzO3c9NDMwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/cf04a2dd22f145c88dac69797afdf93b.jpg",
    "publishedAt": "2018-10-23T09:39:24Z",
    "content": "ANKARA, Turkey (AP) The Latest on the killing of Saudi writer Jamal Khashoggi (all times local): 1 p.m. Turkey's president has urged Saudi Arabia to reveal who ordered the \"savage murder\" of dissident journalist Jamal Khashoggi at the kingdom's consulate in I… [+4363 chars]"
  },
  {
    "source": {
      "id": "rt",
      "name": "RT"
    },
    "author": "RT",
    "title": "Critics use alleged murder of Saudi journalist...to bash Trump",
    "description": "The disappearance of a dissident Saudi journalist in the kingdom’s consulate in Istanbul last Tuesday has offered pundits a golden opportunity to pin the blame on their favorite target: Donald Trump. Read Full Article at RT.com",
    "url": "https://www.rt.com/usa/440811-saudi-journalist-critics-bash-trump/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "urlToImage": "https://cdni.rt.com/files/2018.10/article/5bbd1163dda4c8342b8b45d7.JPG",
    "publishedAt": "2018-10-09T20:39:13Z",
    "content": "The disappearance of Jamal Khashoggi, a US-based self-exiled critic of Saudi regime, is by no means a light matter. His murder has not yet been confirmed, but the accusation is disturbing: Turkish officials have accused the Saudis of murdering the writer at t… [+3638 chars]"
  },
  {
    "source": {
      "id": "rt",
      "name": "RT"
    },
    "author": "RT",
    "title": "Trump under pressure to stop arms sales to ‘good partner’ Saudi Arabia over Khashoggi affair",
    "description": "As public pressure mounts on the Trump administration to halt arms sales to Saudi Arabia over the disappearance of journalist Jamal Khashoggi, the US defense industry is alarmed while critics of the Yemen war hope for the best. Read Full Article at RT.com",
    "url": "https://www.rt.com/usa/441127-trump-saudi-weapons-khashoggi/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "urlToImage": "https://cdni.rt.com/files/2018.10/article/5bc0ec3edda4c8c0768b456b.JPG",
    "publishedAt": "2018-10-12T19:20:42Z",
    "content": "Khashoggi, a Saudi journalist living in Turkey who wrote for the Washington Post, was last seen entering a Saudi consulate in Istanbul last Friday. Turkey claims he was murdered by Saudi assassins, which Riyadh has denied. Several major US weapons manufacture… [+4232 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": null,
    "title": "Trump on missing journalist: I don't like it",
    "description": "Speaking on \"Fox and Friends,\" President Trump says the US is working with Turkey and Saudi Arabia to find out what happened to missing journalist Jamal Kashoggi.",
    "url": "https://www.cnn.com/videos/politics/2018/10/11/trump-saudi-journalist-jamal-kashoggi-fox-and-friends-sot-newday-vpx.cnn",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181002193741-02-donald-trump-file-super-tease.jpg",
    "publishedAt": "2018-10-11T13:19:48Z",
    "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "Nicole Gaouette and Elise Labott, CNN",
    "title": "Trump walks tightrope amid global outrage over disappearance of Saudi journalist",
    "description": "After Jamal Khashoggi entered Saudi Arabia's consulate in Istanbul a little over a week ago and disappeared, leaders and media worldwide demanded the kingdom explain Turkish claims that the journalist had been killed by the Saudi government.",
    "url": "https://www.cnn.com/2018/10/10/politics/trump-saudi-khashoggi-muted-response/index.html",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180320221342-president-trump-hosts-crown-prince-mohammad-bin-salman-of-saudi-arabia-to-white-house-super-tease.jpg",
    "publishedAt": "2018-10-10T23:59:00Z",
    "content": "Washington (CNN) After Jamal Khashoggi entered Saudi Arabia's consulate in Istanbul a little over a week ago and disappeared, leaders and media worldwide demanded the kingdom explain Turkish claims that the journalist had been killed by the Saudi government. … [+7255 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Newyorker.com"
    },
    "author": "Eric Lach",
    "title": "Another Look at Saudi Crown Prince Mohammed bin Salman",
    "description": "Eric Lach on how the disappearance of the journalist Jamal Kashoggi is casting the Saudi crown prince Mohammed bin Salman in a new light, and what work by Dexter Filkins and Robin Wright can tell us about M.B.S.",
    "url": "https://www.newyorker.com/news/current/another-look-at-saudi-crown-prince-mohammed-bin-salman",
    "urlToImage": "https://media.newyorker.com/photos/5bc4d152aaa2d82cf80e1c62/16:9/w_1200,h_630,c_limit/Lach-Current-MBS.jpg",
    "publishedAt": "2018-10-15T17:46:28Z",
    "content": "In Dexter Filkinss April article about the rise to power of Mohammed bin Salman, the crown prince of Saudi Arabia, Filkins included a story that people tell in Riyadh. According to the story, which the Saudi Embassy denies and may be apocryphal, the prince, w… [+2226 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Seattletimes.com"
    },
    "author": "Tamer El-Ghobashy",
    "title": "Saudis admit Khashoggi was killed inside consulate in Turkey",
    "description": "The Saudi government acknowledged early Saturday that journalist Jamal Khashoggi was killed while visiting the Saudi consulate in Istanbul, saying he died during a fist fight.",
    "url": "https://www.seattletimes.com/nation-world/saudis-admit-khashoggi-was-killed-inside-consulate-in-turkey/",
    "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2018/10/8dbd9908-d404-11e8-8d97-f518a665f32f-474x711.jpg",
    "publishedAt": "2018-10-20T03:33:24Z",
    "content": "The Saudi government acknowledged early Saturday that journalist Jamal Khashoggi was killed while visiting the Saudi consulate in Istanbul, saying he died during a fist fight. ISTANBUL The Saudi government acknowledged early Saturday that journalist Jamal Kha… [+4253 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Naturalnews.com"
    },
    "author": "JD Heyes",
    "title": "Elements of the Kashoggi murder story appears to be a massive, coordinated media HOAX",
    "description": "(Natural News) You can always tell these days what the disgustingly dishonest “establishment” media thinks will be ‘the thing’ that brings down POTUS Donald Trump because they cover the issue wall-to-wall and pretend as though it’s the most important thing ev…",
    "url": "https://www.naturalnews.com/2018-10-21-kashoggi-murder-story-coordinated-media-hoax.html",
    "urlToImage": "https://www.naturalnews.com/wp-content/uploads/sites/91/2018/10/trump-varney-fox-business.jpg",
    "publishedAt": "2018-10-21T09:34:43Z",
    "content": "( Natural News ) You can always tell these days what the disgustingly dishonest establishment media thinks will be the thing that brings down POTUS Donald Trump because they cover the issue wall-to-wall and pretend as though its the most important thing ever,… [+3833 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "Nicole Gaouette, Manu Raju and Veronica Stracqualursi, CNN",
    "title": "Khashoggi was murdered, Saudis did it, leading Republican says",
    "description": "A leading Republican senator said Thursday that he believes Saudi journalist Jamal Khashoggi was murdered and that \"there is no question the Saudis did this.\"",
    "url": "https://www.cnn.com/2018/10/11/politics/trump-saudi-arabia-journalist-corker/index.html",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/171219132000-bob-corker-1201-super-tease.jpg",
    "publishedAt": "2018-10-11T16:22:50Z",
    "content": "Washington (CNN) A leading Republican senator said Thursday that he believes Saudi journalist Jamal Khashoggi was murdered and that \"there is no question the Saudis did this.\" Senate Foreign Relations Chairman Bob Corker told CNN that the \"intel points direct… [+5652 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Inquirer.net"
    },
    "author": null,
    "title": "Trump defends Saudis in Kashoggi case, makes Kavanaugh comparison",
    "description": "WASHINGTON --- President Donald Trump Tuesday criticized rapidly mounting global condemnation of Saudi Arabia over the case of missing journalist Jamal Khashoggi, warning of a rush to judgment. In an interview with The Associated Press, Trump compared the sit…",
    "url": "http://usa.inquirer.net/16036/trump-defends-saudis-kashoggi-case-makes-kavanaugh-comparison",
    "urlToImage": "http://usa.inquirer.net/files/2018/10/president-donald-trump-prince-mohammed-bin-salman-of-saudi-arabia-ap.jpg",
    "publishedAt": "2018-10-17T17:50:58Z",
    "content": "President Donald Trump with Saudi Arabia’s Prince Mohammed bin Salman. AP PHOTO WASHINGTON President Donald Trump Tuesday criticized rapidly mounting global condemnation of Saudi Arabia over the case of missing journalist Jamal Khashoggi, warning of a rush to… [+2589 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Inquirer.net"
    },
    "author": null,
    "title": "On journalism, truth and Filipino History Month",
    "description": "This was intended to be a light column. But it's hard when you consider journalism is one of the world's most dangerous jobs. The price of truth, right? So, we pause to pay our respects to Saudi Arabian journalist Jamal Khashoggi, an American permanent reside…",
    "url": "http://usa.inquirer.net/15972/journalism-truth-filipino-history-month",
    "urlToImage": "http://usa.inquirer.net/files/2018/10/CALIVA-284-e1536858029291.jpg",
    "publishedAt": "2018-10-15T17:34:26Z",
    "content": "This was intended to be a light column. But its hard when you consider journalism is one of the worlds most dangerous jobs. The price of truth, right? So, we pause to pay our respects to Saudi Arabian journalist Jamal Khashoggi, an American permanent resident… [+9855 chars]"
  },
  {
    "source": {
      "id": "financial-times",
      "name": "Financial Times"
    },
    "author": null,
    "title": "Pound weakens on Brexit stalemate, oil rises as Saudi Arabia hits back",
    "description": "Asia stocks resumed declines on Monday as concerns over US rates lingered, while the pound fell following a Brexit stalemate and oil prices jumped after Saudi Arabia responded strongly to criticism over the disappearance of a journalist.",
    "url": "https://www.ft.com/content/4ed93de4-d032-11e8-a9f2-7574db66bcd5",
    "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__assets%2Fcreatives%2Fopen-graph%2Ffastft-v1.jpg?source=next-opengraph&fit=scale-down&width=900",
    "publishedAt": "2018-10-15T04:58:29Z",
    "content": "Asia stocks resumed declines on Monday as concerns over US rates lingered, while the pound fell following a Brexit stalemate and oil prices jumped after Saudi Arabia responded strongly to criticism over the disappearance of a journalist. Equities fell across … [+1559 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Wordpress.com"
    },
    "author": "whyevolutionistrue",
    "title": "Dissident Saudi journalist in America probably killed on Turkish soil after going to Saudi consulate in Istanbul",
    "description": "I’m not absolutely sure that Jamal Kashoggi has been murdered, but it’s pretty likely. Kashoggi, a Saudi journalist became self-exiled when he began criticizing —in the pages of the Washington Post—the new Saudi government (i.e., Crown Prince Mohammed bin Sal…",
    "url": "https://whyevolutionistrue.wordpress.com/2018/10/08/saudi-journalist-in-america-killed-on-turkish-soil-after-going-to-saudi-embassy/",
    "urlToImage": "https://secure.gravatar.com/blavatar/275a941f238847ec6ac2ac1812b88f9f?s=200&ts=1539022224",
    "publishedAt": "2018-10-08T17:45:12Z",
    "content": "I’m not absolutely sure that Jamal Kashoggi has been murdered, but it’s pretty likely. Kashoggi, a Saudi journalist became self-exiled when he began criticizing in the pages of the Washington Post the new Saudi government (i.e., Crown Prince Mohammed bin Salm… [+2864 chars]"
  },
  {
    "source": {
      "id": "the-guardian-au",
      "name": "The Guardian (AU)"
    },
    "author": "Owen Jones",
    "title": "Britain has sold its soul to the House of Saud. Shame on us | Owen Jones",
    "description": "Outrage over the murder of Jamal Kashoggi will not last. Our complicity with this murderous dictatorship is a scandal There is, finally, some scrutiny of Britain’s sordid relationship with one of the most abhorrent dictatorships on Earth. That it has taken th…",
    "url": "https://www.theguardian.com/commentisfree/2018/oct/24/britain-house-of-saud-jamal-khashoggi-murder",
    "urlToImage": "https://i.guim.co.uk/img/media/760ca09186c0acdc2e2f2a7cc8708763e2f794ad/0_30_3400_2040/master/3400.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&s=cb41dbf483a28b28117bbbd89d226975",
    "publishedAt": "2018-10-24T17:50:29Z",
    "content": "T here is, finally, some scrutiny of Britains sordid relationship with one of the most abhorrent dictatorships on Earth. That it has taken the murder of a journalist rather than, say, Saudi Arabias remorseless war in Yemen, now the worlds worst humanitarian c… [+5418 chars]"
  },
  {
    "source": {
      "id": "msnbc",
      "name": "MSNBC"
    },
    "author": "MSNBC.com",
    "title": "President Trump's financial history with Saudi Arabia",
    "description": "President Trump says the king of Saudi Arabia denies any involvement of the disappearance of journalist Jamal Kashoggi . But the president's acceptance of the king's denial is wrapped up in a long financial history with the country. Ali Velshi takes a closer …",
    "url": "https://www.msnbc.com/velshi-ruhle/watch/president-trump-s-financial-history-with-saudi-arabia-1344663107739",
    "urlToImage": "https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201810/n_vr_saudimoney_181015_1920x1080.1200;630;7;70;5.jpg",
    "publishedAt": "2018-10-15T18:34:36Z",
    "content": null
  },
  {
    "source": {
      "id": "rte",
      "name": "RTE"
    },
    "author": "RTÉ News",
    "title": "Turkey and Saudi Arabia discuss Jamal Kashoggi case",
    "description": "Turkey's President Recep Tayyip Erdogan and Saudi King Salman last night discussed the case of missing journalist Jamal Khashoggi in their first telephone talks on the controversy, both sides said.",
    "url": "https://www.rte.ie/news/2018/1015/1003182-turkey-and-saudi-arabia/",
    "urlToImage": "https://img.rasset.ie/0010d1d2-1600.jpg",
    "publishedAt": "2018-10-15T02:55:47Z",
    "content": "Turkey's President Recep Tayyip Erdogan and Saudi King Salman last night discussed the case of missing journalist Jamal Khashoggi in their first telephone talks on the controversy, both sides said. Erdogan and Salman discussed \"the issue of shedding light on … [+1232 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Talkingpointsmemo.com"
    },
    "author": "Nicole Lafond",
    "title": "Prominent Washington Think Tank Cutting Off Donations From Saudis",
    "description": "In just the latest retaliatory move against Saudi Arabia in recent days, prominent Washington think tank, the Middle East Institute,...",
    "url": "https://talkingpointsmemo.com/news/think-tanks-respond-saudi-journalist",
    "urlToImage": "https://d15zn84cat5tp0.cloudfront.net/wp-content/uploads/2018/10/GettyImages-1051857002.jpg",
    "publishedAt": "2018-10-16T12:25:53Z",
    "content": "In just the latest retaliatory move against Saudi Arabia in recent days, prominent Washington think tank, the Middle East Institute, announced it’s not seeking donations from Saudi Arabia until after an investigation is conducted, Buzzfeed News reported. “The… [+1008 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Firstpost.com"
    },
    "author": "The Associated Press",
    "title": "As business leaders begin to shun Saudi Arabia over Jamal Khashoggi disappearance, big blow to oil-rich country’s economic reputation",
    "description": "The disappearance of Saudi journalist Jamal Khashoggi last seen entering the kingdom's consulate in Istanbul has shaken businesses' confidence in the country as a place to do business, with potential consequences for billions of dollars in investments into an…",
    "url": "https://www.firstpost.com/world/as-business-leaders-begin-to-shun-saudi-arabia-over-jamal-khashoggi-disappearance-big-blow-to-oil-rich-countrys-economic-reputation-5412421.html",
    "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/10/saudi-pompeo.jpg",
    "publishedAt": "2018-10-19T16:16:09Z",
    "content": "Frankfurt: The disappearance of a Saudi journalist last seen entering the kingdom's consulate in Istanbul has shaken businesses' confidence in the country as a place to do business, with potential consequences for billions of dollars in investments into and o… [+5887 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Sputniknews.com"
    },
    "author": "Sputnik",
    "title": "Germany Must Take Extra International Measures Over Khashoggi's Death – AfD",
    "description": "MOSCOW (Sputnik) - Berlin should take further international measures in connection with the death of Saudi opposition journalist Jamal Khashoggi after delivering on its pledge to halt arms sales to Riyadh, a member of the Bundestag's Defense Committee from th…",
    "url": "https://sputniknews.com/analysis/201810241069154347-germany-usa-saudi-arabia-khashoggi-death-measures/",
    "urlToImage": "https://cdn5.img.sputniknews.com/images/106872/58/1068725836.jpg",
    "publishedAt": "2018-10-23T21:44:00Z",
    "content": "MOSCOW (Sputnik) - Berlin should take further international measures in connection with the death of Saudi opposition journalist Jamal Khashoggi after delivering on its pledge to halt arms sales to Riyadh, a member of the Bundestag's Defense Committee from th… [+2183 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "Clare Foran, CNN",
    "title": "Awaiting Trump response, key GOP lawmakers call for answers, action on missing Saudi journalist",
    "description": "Prominent Republican lawmakers on Tuesday continued to forcefully call for answers and retaliatory action over the disappearance of Saudi journalist Jamal Khashoggi while they wait to see how the Trump administration will respond.",
    "url": "https://www.cnn.com/2018/10/16/politics/khashoggi-saudi-arabia-congress/index.html",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181016101632-marco-rubio-saudi-arabia-1-super-tease.jpg",
    "publishedAt": "2018-10-16T21:24:29Z",
    "content": "Washington (CNN) Prominent Republican lawmakers on Tuesday continued to forcefully call for answers and retaliatory action over the disappearance of Saudi journalist Jamal Khashoggi while they wait to see how the Trump administration will respond. Republican … [+4519 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "Zachary Cohen and Elise Labott, CNN",
    "title": "Trump 'concerned' about missing journalist; Saudis deny involvement",
    "description": "President Donald Trump said Monday that he was \"concerned\" about reports on the disappearance of journalist Jamal Khashoggi, a Washington Post writer and Saudi royal court insider-turned-critic.",
    "url": "https://www.cnn.com/2018/10/08/politics/trump-saudi-ambassador-to-us-jamal-khashoggi/index.html",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181003085839-01-jamal-khashoggi-file-super-tease.jpg",
    "publishedAt": "2018-10-09T00:44:07Z",
    "content": "Washington (CNN) President Donald Trump said Monday that he was \"concerned\" about reports on the disappearance of journalist Jamal Khashoggi, a Washington Post writer and Saudi royal court insider-turned-critic. \"I am concerned about that,\" Trump said. \"I don… [+4254 chars]"
  },
  {
    "source": {
      "id": "cnn",
      "name": "CNN"
    },
    "author": "Doug Criss, CNN",
    "title": "5 things to know for October 9: Hurricane Michael, Kavanaugh, New York limo crash, Saudi journalist, climate change",
    "description": "Here's what else you need to know to Get Up to Speed and Out the Door.",
    "url": "https://www.cnn.com/2018/10/09/us/five-things-october-9-trnd/index.html",
    "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181009041048-tuesday-hurricane-michael-update-weather-super-tease.jpg",
    "publishedAt": "2018-10-09T10:07:21Z",
    "content": "(CNN) Congrats to New Orleans Saints quarterback Drew Brees. On Monday night, he broke Peyton Manning's record to become the NFL's all-time leader in passing. Here's what else you need to know to Get Up to Speed and Out the Door. This morning Hurricane Michae… [+4434 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Dw.com"
    },
    "author": "Deutsche Welle (www.dw.com)",
    "title": "IMF's Christine Lagarde 'horrified' by Khashoggi case, still plans Saudi visit",
    "description": "Ankara claims to have evidence that Jamal Khashoggi was murdered at the Saudi consulate in Istanbul. IMF chief Christine Lagarde said she would be \"very attentive\" to new information about the missing Saudi journalist.",
    "url": "https://www.dw.com/en/imfs-christine-lagarde-horrified-by-khashoggi-case-still-plans-saudi-visit/a-45872066",
    "urlToImage": "https://www.dw.com/image/41112629_304.jpg",
    "publishedAt": "2018-10-13T07:43:00Z",
    "content": "Christine Lagarde, managing director of the International Monetary Fund (IMF), said Saturday she was \"horrified\" by reports about the missing Saudi journalist, Jamal Khashoggi, but would not cancel her plans to attend an elite economic meeting in Riyadh later… [+3647 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Reason.com"
    },
    "author": "Elizabeth Nolan Brown",
    "title": "Trump Seems More Skeptical of Elizabeth Warren's Ancestry Test Than of Saudi Innocence in Death of Jamal Khashoggi: Reason Roundup",
    "description": "Plus: HHS proposes new drug-ad disclosures.",
    "url": "https://reason.com/blog/2018/10/16/trump-skeptical-of-warren-dna-not-saudis",
    "urlToImage": "https://d1jn4vzj53eli5.cloudfront.net/db/15396964022204.jpg",
    "publishedAt": "2018-10-16T13:30:00Z",
    "content": "Editor's Note : We invite comments and request that they be civil and on-topic. We do not moderate or assume any responsibility for comments, which are owned by the readers who post them. Comments do not represent the views of Reason.com or Reason Foundation.… [+15436 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thefederalist.com"
    },
    "author": "David Marcus",
    "title": "Trump Is Right To Be Cautious With The Saudis On Kashoggi",
    "description": "President Trump is facing an international crisis with no obvious good fix. So his slow, measured approach is the right one.",
    "url": "http://thefederalist.com/2018/10/17/trump-is-right-to-be-cautious-with-the-saudis-on-kashoggi/",
    "urlToImage": "http://thefederalist.com/wp-content/uploads/2018/10/Donald_Trump_29496131773-e1539810765804.jpg",
    "publishedAt": "2018-10-17T21:13:04Z",
    "content": "This summer I had the opportunity to spend a week at the Army War College for its National Security Seminar. There I learned alongside the officer and diplomatic corps students, mainly colonels preparing for major commands, about the threats facing our countr… [+6082 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Thefederalist.com"
    },
    "author": "Sumantra Maitra",
    "title": "The United States Can’t Ditch Saudi Arabia, But It Shouldn’t Let Khashoggi Slide, Either",
    "description": "Looking away from Saudi perfidy is an embarrassment to the thesis of a rule-based order, but be careful about ditching Riyadh for the sake of idealism.",
    "url": "http://thefederalist.com/2018/10/19/supporting-saudi-deceit-is-against-us-values-but-we-cant-ditch-riyadh/",
    "urlToImage": "http://thefederalist.com/wp-content/uploads/2017/11/1024px-Donald_Trump_and_Mohammad_bin_Salman_Al_Saud_in_the_Oval_Office_March_14_2017.jpg",
    "publishedAt": "2018-10-19T11:19:10Z",
    "content": "Americas gaffe-prone granddad Joe Biden had a rare moment of intellectual clarity and honesty in 2014, when he said something about Saudi Arabia that would be blindingly obvious to anyone except perhaps Thomas Friedman and the New York Times editorial board. … [+7852 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Mediaite.com"
    },
    "author": "Aidan McLaughlin",
    "title": "Trump Administration Mute Amid Mounting Calls to Condemn Saudi Arabia Over Reported Murder of Journalist",
    "description": "The Washington Post writer and Saudi dissident went to the Saudi Consulate in Turkey last week and hasn't been seen since. Nor has any comment from Trump.",
    "url": "https://www.mediaite.com/trump/trump-administration-mute-amid-mounting-calls-to-condemn-saudi-arabia-over-reported-murder-of-journalist/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2018/10/GettyImages-1047546166.jpg ?>",
    "publishedAt": "2018-10-08T17:18:23Z",
    "content": "Jamal Khashoggi, Washington Post columnist and prominent Saudi dissident, walked into the Saudi Consulate in Istanbul last week to pick up a document needed for his marriage. He has not been seen since. Turkish investigators said they believe Khashoggi was ki… [+5238 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Mediaite.com"
    },
    "author": "Aidan McLaughlin",
    "title": "Conservative WH Reporter Rails Against Jamal Khashoggi, Suggests He Was Murdered Because He’s a ‘Radical Activist’",
    "description": "Strap yourselves in folks, because a host on conservative streaming platform CRTV went on an absolutely bonkers and fact-challenged rant about the alleged murder of Saudi dissident Jamal Khashoggi by smearing him as an Islamic extremist.",
    "url": "https://www.mediaite.com/online/conservative-wh-reporter-rails-against-jamal-khashoggi-suggests-he-was-murdered-because-hes-a-radical-activist/",
    "urlToImage": "https://www.mediaite.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-17-at-18.45.48.jpg",
    "publishedAt": "2018-10-17T23:18:59Z",
    "content": "Strap yourselves in folks, because a host on conservative streaming platform CRTV went on an absolutely bonkers and fact-challenged rant about the alleged murder of Saudi dissident Jamal Khashoggi by smearing him as an Islamic extremist. The bizarre rant from… [+2608 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Fxstreet.com"
    },
    "author": "Haresh Menghani",
    "title": "US stocks rebound sharply after yesterday's selloff",
    "description": "Major US equity indices kicked off Friday's trading session on a positive note and attempted a goodish rebound after previous session's slump. The US markets tracked rebound in China’s main equity benchmarks, witnessing their best daily gains since early Augu…",
    "url": "https://www.fxstreet.com/news/us-stocks-rebound-sharply-after-yesterdays-selloff-201810191401",
    "urlToImage": "https://editorial.azureedge.net/images/Markets/Equities/DowJones/DowJones_frontbuilding_Large.jpg",
    "publishedAt": "2018-10-19T14:01:00Z",
    "content": "Major US equity indices kicked off Friday's trading session on a positive note and attempted a goodish rebound after previous session's slump. The US markets tracked rebound in China’s main equity benchmarks, witnessing their best daily gains since early Augu… [+1086 chars]"
  },
  {
    "source": {
      "id": "news24",
      "name": "News24"
    },
    "author": null,
    "title": "News24.com | 'This is a political murder' - Turkey's Erdogan says Saudis planned writer Khashoggi's killing days before",
    "description": "Turkey's president says Saudi officials started planning to murder Saudi writer Jamal Khashoggi days before his death in Saudi Arabia's Istanbul consulate.",
    "url": "https://www.news24.com/World/News/this-is-a-political-murder-turkeys-erdogan-says-saudis-planned-writer-khashoggis-killing-days-before-20181023",
    "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/8048/3b2696a8a3984f3b9f947e3a57f9880e.jpg",
    "publishedAt": "2018-10-23T10:17:19Z",
    "content": "The Latest on the killing of Saudi writer Jamal Khashoggi (all times local): 12:40 Turkey's president says Saudi officials started planning to murder Saudi writer Jamal Khashoggi days before his death in Saudi Arabia's Istanbul consulate. President Recep Tayy… [+3642 chars]"
  },
  {
    "source": {
      "id": "fortune",
      "name": "Fortune"
    },
    "author": "Glenn Fleishman",
    "title": "CNN’s Jeff Zucker Blasts Trump’s Repeated Attacks on Media and Journalists After Potential Bomb at Network",
    "description": "\"There is a total and complete lack of understanding at the White House about the seriousness of their continued attacks on the media.\"",
    "url": "http://fortune.com/2018/10/24/cnn-chief-blasts-trump-over-media-attacks/",
    "urlToImage": "https://fortunedotcom.files.wordpress.com/2018/10/gettyimages-521599536.jpg",
    "publishedAt": "2018-10-24T23:28:06Z",
    "content": "Hours after CNN staff evacuated from the Time Warner Center in Manhattan due to the discovery of a suspicious package believed to be a bomb, CNN World President Jeff Zucker issued a scathing statement criticizing President Donald Trump for his attacks on medi… [+4039 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Wng.org"
    },
    "author": "Web Editor",
    "title": "Military show of force",
    "description": "NORWAY: The largest military exercise in NATO history gets underway Thursday. Dubbed Trident Juncture, the two-week show of force features all 29 NATO members, plus Finland and Sweden, involving 50,000 troops and 10,000 vehicles. Days ahead of its start, the …",
    "url": "https://world.wng.org/content/military_show_of_force",
    "urlToImage": "https://world.wng.org/sites/default/files/GettyImages-1051978406.jpg",
    "publishedAt": "2018-10-24T17:03:42Z",
    "content": "NORWAY: The largest military exercise in NATO history gets underway Thursday. Dubbed Trident Juncture, the two-week show of force features all 29 NATO members, plus Finland and Sweden, involving 50,000 troops and 10,000 vehicles. Days ahead of its start, the … [+2713 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Wng.org"
    },
    "author": "Web Editor",
    "title": "A new government for Iraq",
    "description": "IRAQ gets a new government—and it was worth the wait. In Nineveh Plain, the Knights of Columbus signed an agreement with the U.S. Agency for International Development to work together on a planned $195 million recovery program targeting Christian and other co…",
    "url": "https://world.wng.org/content/a_new_government_for_iraq",
    "urlToImage": "https://world.wng.org/sites/default/files/AP_18276465511742.jpg",
    "publishedAt": "2018-10-17T18:12:08Z",
    "content": "IRAQ gets a new governmentand it was worth the wait. In Nineveh Plain, the Knights of Columbus signed an agreement with the U.S. Agency for International Development to work together on a planned $195 million recovery program targeting Christian and other com… [+1583 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Hurriyetdailynews.com"
    },
    "author": "hurriyetdailynews.com",
    "title": "Sneakers exposed Khashoggi’s body double: Columnist",
    "description": "A Saudi operative failed in his attempt to deceive Turkish security officials by wearing the clothes of journalist Jamal Khashoggi because he did not bother changing his shoes, according to a police source cited by daily Hürriyet columnist Abdulkadir Selvi on…",
    "url": "http://www.hurriyetdailynews.com/sneakers-exposed-khashoggis-body-double-columnist-138167",
    "urlToImage": "http://i.hurimg.com/i/hdn/75/200x200/5bceb67e0f254322a074049e.jpg",
    "publishedAt": "2018-10-23T05:50:53Z",
    "content": "ISTANBUL A Saudi operative failed in his attempt to deceive Turkish security officials by wearing the clothes of journalist Jamal Khashoggi because he did not bother to change his shoes, according to a police source cited by daily Hürriyet columnist Abdulkadi… [+3058 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Globalsecurity.org"
    },
    "author": "John Pike",
    "title": "World 'deserves to know the truth' behind Kashoggi disappearance: UN human rights chief",
    "description": "United Nations human rights chief Michele Bachelet said on Wednesday that she was open to an independent, UN-led investigation into the fate of Saudi journalist Jamal Kashoggi, if joint efforts by Turkey and Saudi Arabia, fail to uncover the facts.",
    "url": "https://www.globalsecurity.org/wmd/library/news/saudi/saudi-181017-unnews01.htm",
    "urlToImage": null,
    "publishedAt": "2018-10-18T01:58:30Z",
    "content": "17 October 2018 - United Nations human rights chief Michele Bachelet said on Wednesday that she was open to an independent, UN-led investigation into the fate of Saudi journalist Jamal Kashoggi, if joint efforts by Turkey and Saudi Arabia, fail to uncover the… [+1836 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Counterpunch.org"
    },
    "author": "Gary Leupp",
    "title": "Will Trump Split the World by Endorsing a Bold-Faced Lie?",
    "description": "The Saudi “investigation” into the Khashoggi murder, conducted on the demand of U.S. Secretary of State Mike Pompeo, is not yet complete. But preliminary conclusions have been announced in the Saudi media. Turns out (surprise, surprise!) Khashoggi died while …",
    "url": "https://www.counterpunch.org/2018/10/22/will-trump-split-the-world-by-endorsing-a-bold-faced-lie/",
    "urlToImage": "https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png",
    "publishedAt": "2018-10-22T08:56:42Z",
    "content": "The Saudi “investigation” into the Khashoggi murder, conducted on the demand of U.S. Secretary of State Mike Pompeo, is not yet complete. But preliminary conclusions have been announced in the Saudi media. Turns out (surprise, surprise!) Khashoggi died while … [+5152 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Counterpunch.org"
    },
    "author": "Raouf Halaby",
    "title": "Assassination as a Criminal Tool by the Powerful Against the Weak and Oppressed",
    "description": "Only recently a spat between Saudi Arabia and Canada made headlines as a result of the Saudi Government’s beheading of a Myanmar guest worker. After the public barbaric and gruesome decapitation, the corpse was crucified on a horizontal post with the truncate…",
    "url": "https://www.counterpunch.org/2018/10/24/assassination-as-a-criminal-tool-by-the-powerful-against-the-weak-and-oppressed/",
    "urlToImage": "https://www.counterpunch.org/wp-content/dropzone/2018/06/cp-og-logo.png",
    "publishedAt": "2018-10-24T08:52:08Z",
    "content": "Only recently a spat between Saudi Arabia and Canada made headlines as a result of the Saudi Governments beheading of a Myanmar guest worker. After the public barbaric and gruesome decapitation, the corpse was crucified on a horizontal post with the truncated… [+12315 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Boyculture.com"
    },
    "author": "Matthew Rettenmund",
    "title": "Aaron Hernandez's Teen BF Speaks + GOLDEN GIRLS Cereal + Trump Backs Saudi Arabia + Cardi B's Madonna Tribute + Stacey Abrams Joins Pride + MORE! — 12-PACK",
    "description": "Aaron Hernandez's Teen BF Speaks + GOLDEN GIRLS Cereal + Trump Backs Saudi Arabia + Cardi B's Madonna Tribute + Stacey Abrams Joins Pride + MORE! — 12-PACK",
    "url": "https://www.boyculture.com/boy_culture/2018/10/trump-kashoggi-aaron-hernandez-gay.html",
    "urlToImage": null,
    "publishedAt": "2018-10-15T17:03:42Z",
    "content": "ABOVE: Nice view. // BELOW: Keep reading for Aaron Hernandez's teen lover spilling the beans, Golden Girls cereal, Trump sticking up for Saudi Arabia, Marie Osmond weeping over the suppression of Christianity and much more... Hernandez & SanSoucie, secret BFs… [+2809 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Boyculture.com"
    },
    "author": "Matthew Rettenmund",
    "title": "Aaron Hernandez's Teen BF Speaks + GOLDEN GIRLS Cereal + Trump Backs Saudi Arabia + Cardi B's Madonna Tribute + Stacey Abrams Joins Pride + MORE! — 12-PACK",
    "description": "Aaron Hernandez's Teen BF Speaks + GOLDEN GIRLS Cereal + Trump Backs Saudi Arabia + Cardi B's Madonna Tribute + Stacey Abrams Joins Pride + MORE! — 12-PACK",
    "url": "http://www.boyculture.com/boy_culture/2018/10/trump-kashoggi-aaron-hernandez-gay.html",
    "urlToImage": "http://www.boyculture.com/.a/6a00d8341c2ca253ef022ad3b8bc6c200b-600wi",
    "publishedAt": "2018-10-15T17:03:42Z",
    "content": "ABOVE: Nice view. apntag.anq.push(function() { //signal to script that this DOM element has been loaded and is ready to be populated with an ad apntag.showTag('outstream_div'); }); BELOW: Keep reading for Aaron Hernandez's teen lover spilling the beans, Golde… [+2969 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Mondoweiss.net"
    },
    "author": "Jonathan Ofir",
    "title": "Saudi Arabia admits to killing of Khashoggi, accidentally, in ‘fist fight,’ during ‘discussions’",
    "description": "The Saudis have finally changed their story - they do not deny that Kashoggi was killed at the Consulate in Turkey, but say that it was merely an accident, due to a fist fight. And Donald Trump finds the story \"credible,\" in his capacity as apologist for Moha…",
    "url": "https://mondoweiss.net/2018/10/khashoggi-accidentally-discussions/",
    "urlToImage": "https://s19453.pcdn.co/wp-content/uploads/2018/10/skynews-jamal-khashoggi-saudi-journalist_4446084.jpg",
    "publishedAt": "2018-10-20T15:23:25Z",
    "content": "Saudi Arabia has now finally changed its story about the disappearance and alleged murder of American-Saudi journalist Jamal Khashoggi in Turkey. Now they admit he was killed, but by accident, in a fist fight during discussions that took place with him at the… [+4171 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Mondoweiss.net"
    },
    "author": "James North",
    "title": "Saudi Crown Prince Mohammed bin Salman, lionized by U.S. pundits and politicians, is a — suspected murderer",
    "description": "Mohammed bin Salman, the Saudi Crown Prince highly praised as a \"reformer,\" must now answer for the suspected murder of the dissident journalist Jamal Khashoggi. NYT columnist Tom Friedman slathered \"MBS\" with praise less than a year ago, surely in part becau…",
    "url": "https://mondoweiss.net/2018/10/politicians-suspected-murderer/",
    "urlToImage": "https://s19453.pcdn.co/wp-content/uploads/2018/04/mohammed.bin_.salman.jpg",
    "publishedAt": "2018-10-07T13:55:26Z",
    "content": "Crown Prince Mohammed bin Salman, the 33-year-old de facto leader of Saudi Arabia widely praised as a reformist by New York Times columnist Thomas Friedman and others, turns out to be a suspected murderer. Heres what happened: 5 days ago, Jamal Khashoggi, a o… [+2881 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Freebeacon.com"
    },
    "author": "Mikhael Smits, Mikhael Smits",
    "title": "Report: Turkey to Free U.S. Pastor Mark Brunson",
    "description": "Long-imprisoned American pastor Andrew Brunson is set to be released from Turkish prison this month, something the Trump administration has demanded for months. The post Report: Turkey to Free U.S. Pastor Mark Brunson appeared first on Washington Free Beacon.",
    "url": "https://freebeacon.com/national-security/report-turkey-to-free-u-s-pastor-mark-brunson/",
    "urlToImage": "https://freebeacon.com/wp-content/uploads/2018/08/GettyImages-1005201762.jpg",
    "publishedAt": "2018-10-11T19:34:34Z",
    "content": "BY: Mikhael Smits Follow @mikhaelsmits October 11, 2018 3:34 pm Long-imprisoned American pastor Andrew Brunson is set to be released from Turkish prison this month, something the Trump administration has demanded for months. Ankara and Washington came to an a… [+3236 chars]"
  },
  {
    "source": {
      "id": "the-hill",
      "name": "The Hill"
    },
    "author": "Brett Samuels",
    "title": "Corker says US will 'respond accordingly' to countries targeting journalists amid columnist's disappearance",
    "description": "Sen. Bob Corker (R-Tenn.) on Monday said the U.S. will \"respond accordingly\" to countries that target journalists as officials investigate the disappearance of Washington Post contributor Jamal Kashoggi.Corker, the...",
    "url": "https://thehill.com/homenews/senate/410452-corker-us-will-respond-accordingly-to-countries-that-target-journalists-amid",
    "urlToImage": "https://thehill.com/sites/default/files/corkerbob_071818gn4_lead.jpg",
    "publishedAt": "2018-10-08T19:29:59Z",
    "content": "Sen. Bob Corker Robert (Bob) Phillips Corker Taylor Swift breaks silence on politics, supports Democrats in Tennessee races Poll: Most voters unlikely to change support in key Senate races based on Kavanaugh proceedings Trump, GOP aim to weaponize Kavanaugh v… [+3670 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Wordpress.com"
    },
    "author": "Mike Rivero",
    "title": "How Saudi Arabia kept contradicting itself over the disappearance of Jamal Khashoggi",
    "description": "SAUDI Arabia wants you to believe its account of a journalist’s abrupt disappearance. But too many little things don’t add up. Saudi Arabia has finally admitted that Khashoggi was killed in their consulate in Istanbul. AFTER more than two weeks of internation…",
    "url": "https://yourperceptionisnotreality.wordpress.com/2018/10/23/how-saudi-arabia-kept-contradicting-itself-over-the-disappearance-of-jamal-khashoggi/",
    "urlToImage": "https://cdn.newsapi.com.au/image/v1/1e967a9fcdcd80a22e3777085a6dce77?width=650",
    "publishedAt": "2018-10-23T16:08:35Z",
    "content": "SAUDI Arabia wants you to believe its account of a journalists abrupt disappearance. But too many little things dont add up. AFTER more than two weeks of international pressure, Saudi Arabia finally came clean. In its most recent admission, the kingdom claime… [+10779 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Farsnews.com"
    },
    "author": "Old_Logan",
    "title": "Saudi Arabia Admits Khashoggi Killed in Turkey, Arrests Several, Sacks Top General",
    "description": "After two weeks of denial by Saudi officials, Riyadh sacked a top general and arrested several people after confessing that dissident journalist Jamal Khashoggi was murdered in the Turkish city of Istanbul, but made no mention of where his body is. Saudi Arab…",
    "url": "http://en.farsnews.com/newstext.aspx?nn=13970728000124",
    "urlToImage": null,
    "publishedAt": "2018-10-21T13:59:55Z",
    "content": "Saudi Arabia said in a Friday announcement that the preliminary results of its investigation indicate Khashoggi had been killed in a \"fight with people who met him in the Saudi consulate in Istanbul”. Saudi Attorney-General Sheikh Saud al-Mojeb stated that Kh… [+4175 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Newsfromtheperimeter.com"
    },
    "author": "LibertyFTPeople",
    "title": "Who Benefits From Khashoggi Assassination",
    "description": "The mainstream media is reporting all the gruesome details of the Khashoggi torture and probable murder (no body), who was a known Intelligence/Deep State asset in the Middle East for decades. So who had the most to gain from his murder and why is the media p…",
    "url": "https://www.newsfromtheperimeter.com/home/2018/10/19/who-benefits-from-khashoggi-assassination",
    "urlToImage": "http://static1.squarespace.com/static/5a0db3de7131a5312972ec1a/5a0e0f55e4966b8729547c65/5bc9ff12e2c483a103d3d082/1539977565841/kash.jpg?format=1000w",
    "publishedAt": "2018-10-19T19:19:53Z",
    "content": "The mainstream media talking heads are reporting all the gruesome details of the Khashoggi torture and probable murder (no body), who was a known Intelligence/Deep State asset in the Middle East for decades. So who had the most to gain from his murder and why… [+4519 chars]"
  },
  {
    "source": {
      "id": "abc-news",
      "name": "ABC News"
    },
    "author": "The Associated Press",
    "title": "Saudi foreign minister promises truth from Khashoggi probe",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "url": "https://abcnews.go.com/International/wireStory/saudi-foreign-minister-promises-truth-khashoggi-probe-58680057",
    "urlToImage": "https://s.abcnews.com/images/International/WireAP_34ec8a2ccc0a472e8e2b5b4d44cd1e2f_16x9_992.jpg",
    "publishedAt": "2018-10-23T06:18:09Z",
    "content": "Saudi Arabia's foreign minister says the investigation into the killing of journalist Jamal Khashoggi will produce the truth about what happened. He also pledged that mechanisms will be put in place so that \"something like this can never happen again.\" Adel a… [+551 chars]"
  },
  {
    "source": {
      "id": "abc-news",
      "name": "ABC News"
    },
    "author": "The Associated Press",
    "title": "The Latest: Economic forum underway in Riyadh",
    "description": "A high-profile economic forum in Saudi Arabia has begun in Riyadh, the kingdom's first major event on the world stage since the killing of writer Jamal Khashoggi at the Saudi Consulate in Istanbul earlier this month",
    "url": "https://abcnews.go.com/International/wireStory/latest-turkey-cooperate-international-probe-58680810",
    "urlToImage": "https://s.abcnews.com/images/International/WireAP_34ec8a2ccc0a472e8e2b5b4d44cd1e2f_16x9_992.jpg",
    "publishedAt": "2018-10-23T08:15:53Z",
    "content": "The Latest on the killing of Saudi writer Jamal Khashoggi (all times local): 11:10 a.m. A high-profile economic forum in Saudi Arabia has begun in Riyadh, the kingdom's first major event on the world stage since the killing of writer Jamal Khashoggi at the Sa… [+2304 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Yahoo.com"
    },
    "author": null,
    "title": "Trump Calls Media The ‘Enemy Of The People.’ Maybe The Saudis Took Him Literally.",
    "description": "WASHINGTON ― The American president who has made a habit of calling news media",
    "url": "https://www.yahoo.com/news/trump-calls-media-enemy-people-230246131.html",
    "urlToImage": "https://s.yimg.com/uu/api/res/1.2/P.jsGH4PMF0dmEseMqElMA--~B/aD0yNzQ3O3c9NDkwNDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/the_huffington_post_584/73ab7483d263e60c9aa7f6eed7c9a026",
    "publishedAt": "2018-10-11T23:02:46Z",
    "content": "WASHINGTON The American president who has made a habit of calling news media the enemy of the people is now facing a possible consequence of his words: the disappearance, perhaps murder, of a Washington-based journalist at the hands of one of the presidents c… [+5685 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Lewrockwell.com"
    },
    "author": "Michael S. Rozeff",
    "title": "Saudi Bad Guy Mohammed bin Salman",
    "description": "“Mohammed bin Salman, who seems to be running Saudi Arabia these days, is one of the bad guys. If he were a good guy, he wouldn’t have attacked his neighboring country, Yemen. He wouldn’t be committing war crimes there in conjunction with vital U.S. support. …",
    "url": "https://www.lewrockwell.com/lrc-blog/saudi-bad-guy-mohammed-bin-salman/",
    "urlToImage": "https://www.lewrockwell.com/wp-content/themes/lrc/images/logo-med.png",
    "publishedAt": "2018-10-14T17:10:55Z",
    "content": "“Mohammed bin Salman, who seems to be running Saudi Arabia these days, is one of the bad guys. If he were a good guy, he wouldnt have attacked his neighboring country, Yemen. He wouldnt be committing war crimes there in conjunction with vital U.S. support. If… [+1727 chars]"
  },
  {
    "source": {
      "id": "daily-mail",
      "name": "Daily Mail"
    },
    "author": "https://www.facebook.com/DailyMail",
    "title": "Eric Trump says U.S. shouldn't 'throw away' relationship with Saudi Arabia over murdered journalist",
    "description": "Eric Trump spoke on Fox news on Friday to lament the death of Saudi journalist Jamal Khashoggi and ask if the US is willing to 'throw away' its relationship with Saudi Arabia over his murder.",
    "url": "https://www.dailymail.co.uk/news/article-6296225/Eric-Trump-says-U-S-shouldnt-throw-away-relationship-Saudi-Arabia-murdered-journalist.html",
    "urlToImage": "https://i.dailymail.co.uk/1s/2018/10/19/21/5215034-0-image-a-32_1539982279337.jpg",
    "publishedAt": "2018-10-19T21:08:45Z",
    "content": "Eric Trump expressed his sympathy for the murder of Saudi journalist Jamal Khashoggi and explained the U.S. has to tread carefully to keep its relationship with the Saudi kingdom. The president's son spoke on Fox News' Outnumbered show on Friday afternoon to … [+4195 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Moonofalabama.org"
    },
    "author": "ladylove",
    "title": "Mainstream Journos Pissed As Saudi Clown Prince Nabs One Of Their Own",
    "description": "The Mustache of Understanding, New York Times columnist Thomas Friedman, is pissed that the Saudi clown prince Mohammad bin Salman ordered the kidnapping of the Saudi journalist Jamal Khashoggi. Every ten minutes a child in Yemen starves because of the famine…",
    "url": "http://www.moonofalabama.org/2018/10/mainstream-journos-are-pissed-that-their-beloved-saudi-clown-prince-nabs-one-of-their-class.html",
    "urlToImage": null,
    "publishedAt": "2018-10-09T17:53:32Z",
    "content": "Mainstream Journos Pissed As Saudi Clown Prince Nabs One Of Their Own The Moustache of Understanding, New York Times columnist Thomas Friedman, is pissed that the Saudi clown prince Mohammad bin Salman ordered the kidnapping of the Saudi journalist Jamal Khas… [+38360 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Farsnews.com"
    },
    "author": "ladylove",
    "title": "Pompeo Tells Bin Salman He Should Take Responsibility in Khashoggi Case as His Future as King Is in Danger",
    "description": "TEHRAN (FNA)- US Secretary of State Mike Pompeo has sternly told Saudi Crown Prince Mohammad bin Salman (MbS) during a meeting in Riyadh on Tuesday that the first in line to the throne would have to take responsibility in disappearance case of journalist Jama…",
    "url": "http://en.farsnews.com/newstext.aspx?nn=13970726000677",
    "urlToImage": null,
    "publishedAt": "2018-10-18T22:10:04Z",
    "content": "A person familiar with the meeting told The New York Times that Pompeo sternly told the crown prince that even if he did not know whether Khashoggi had been killed, he would have to take responsibility to help the kingdom avoid the consequences of an internat… [+5302 chars]"
  },
  {
    "source": {
      "id": "the-jerusalem-post",
      "name": "The Jerusalem Post"
    },
    "author": "By REUTERS",
    "title": "Erdogan: Jamal Kashoggi was slain in a violent, vicious murder",
    "description": "The Turkish president, in a speech in front of parliament, outlined the timeline of the journalist's murder and called for the trial to be held in Turkey.",
    "url": "https://www.jpost.com/Middle-East/Erdogan-Jamal-Kashoggi-was-slain-in-a-violent-vicious-murder-570084",
    "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_Article2016_ControlFaceDetect/430837",
    "publishedAt": "2018-10-23T09:47:45Z",
    "content": "X Dear Reader, As you can imagine, more people are reading The Jerusalem Post than ever before. Nevertheless, traditional business models are no longer sustainable and high-quality publications, like ours, are being forced to look for new ways to keep going. … [+2793 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Japantimes.co.jp"
    },
    "author": "Kuni Miyake",
    "title": "How much do we know about Saudi Arabia?",
    "description": "The Khashoggi crisis is the first and probably the biggest test for Crown Prince Muhammad bin Salman as a leader of Saudi Arabia.",
    "url": "https://www.japantimes.co.jp/opinion/2018/10/15/commentary/world-commentary/much-know-saudi-arabia/",
    "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/10/p8-Miyake-a-20181016-870x580.jpg",
    "publishedAt": "2018-10-15T11:09:59Z",
    "content": "One of Saudi Arabia’s most prominent journalists has been missing since Oct. 2. He was last seen entering the building of the Consulate-General of Saudi Arabia in Istanbul. Turkish officials and media say he was murdered inside the consulate, while the govern… [+5883 chars]"
  },
  {
    "source": {
      "id": null,
      "name": "Marketplace.org"
    },
    "author": "bbradford",
    "title": "Saudi hopes for foreign investment dim after Khashoggi death",
    "description": "Foreign investors had again begun to look to Riyadh.",
    "url": "https://www.marketplace.org/2018/10/22/world/saudi-hopes-foreign-investment-dim-after-kashoggi-killing",
    "urlToImage": "https://cms.marketplace.org/sites/default/files/styles/primary-image-900x500/public/GettyImages-1052405432.jpg?itok=_kt3q_NE",
    "publishedAt": "2018-10-19T23:14:32Z",
    "content": "By Ben Bradford October 22, 2018 | 8:03 AM Embed Code &lt;iframe src=\"https://www.marketplace.org/2018/10/22/world/saudi-hopes-foreign-investment-dim-after-kashoggi-killing/popout\" frameborder=\"0\" width=\"100%\" height=\"240px\"&gt;&lt;/iframe&gt; Security member… [+2556 chars]"
  }
]